jmeter.log
2019-10-01 18:00:33,381 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2019-10-01 18:00:33,398 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.0/libexec/bin/user.properties
2019-10-01 18:00:33,399 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.0/libexec/bin/system.properties
2019-10-01 18:00:33,399 INFO o.a.j.JMeter: Setting System property: userName=jahid
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: Version 5.0 r1840935
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: java.version=1.8.0_181
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: os.name=Mac OS X
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: os.arch=x86_64
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: os.version=10.14.6
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: file.encoding=UTF-8
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: Max memory     =1073741824
2019-10-01 18:00:33,403 INFO o.a.j.JMeter: Available Processors =12
2019-10-01 18:00:33,406 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-10-01 18:00:33,406 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2019-10-01 18:00:33,406 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.0/libexec
2019-10-01 18:00:33,406 INFO o.a.j.JMeter: user.dir  =/Users/jahidul/IdeaProjects/B1902JMeter
2019-10-01 18:00:33,407 INFO o.a.j.JMeter: PWD       =/Users/jahidul/IdeaProjects/B1902JMeter
2019-10-01 18:00:33,432 INFO o.a.j.JMeter: IP: 172.29.2.29 Name: Mds-MacBook-Pro-2.local FullName: 172.29.2.29
2019-10-01 18:00:33,435 INFO o.a.j.s.FileServer: Default base='/Users/jahidul/IdeaProjects/B1902JMeter'
2019-10-01 18:00:33,439 INFO o.a.j.s.FileServer: Set new base='/Users/jahidul/IdeaProjects/B1902JMeter'
2019-10-01 18:00:33,536 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-10-01 18:00:33,551 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-10-01 18:00:33,555 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-10-01 18:00:33,559 INFO o.a.j.s.SaveService: Loading file: Jira.jmx
2019-10-01 18:00:33,594 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-10-01 18:00:33,600 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-10-01 18:00:33,623 INFO o.a.j.JMeter: Creating summariser <summary>
2019-10-01 18:00:33,627 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-10-01 18:00:33,627 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-10-01 18:00:33,627 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-10-01 18:00:33,631 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-10-01 18:00:33,631 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-10-01 18:00:33,880 INFO o.a.j.JMeter: Running test (1569967233880)
2019-10-01 18:00:33,909 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2019-10-01 18:00:33,910 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2019-10-01 18:00:33,910 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-10-01 18:00:33,910 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 perThread=1000.0 delayedStart=false
2019-10-01 18:00:33,914 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-10-01 18:00:33,914 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-10-01 18:00:33,916 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2019-10-01 18:00:33,933 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Mds-MacBook-Pro-2.local
2019-10-01 18:00:33,939 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-10-01 18:00:33,941 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-10-01 18:00:33,941 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2019-10-01 18:00:33,941 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-10-01 18:00:33,941 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-10-01 18:00:34,084 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    4.9/s Avg:    59 Min:    59 Max:    59 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2019-10-01 18:00:34,164 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2019-10-01 18:00:34,164 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2019-10-01 18:00:34,166 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-10-01 18:00:34,167 INFO o.a.j.r.Summariser: summary +      2 in 00:00:00 =   24.4/s Avg:    33 Min:     0 Max:    66 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2019-10-01 18:00:34,167 INFO o.a.j.r.Summariser: summary =      3 in 00:00:00 =   10.5/s Avg:    41 Min:     0 Max:    66 Err:     0 (0.00%)